import csv

data = [
    {"Ім'я": "Студент1", "Дисципліна1": 5, "Дисципліна2": 4, "Дисципліна3": 5, "Дисципліна4": 3},
    {"Ім'я": "Студент2", "Дисципліна1": 4, "Дисципліна2": 5, "Дисципліна3": 4, "Дисципліна4": 5},
    {"Ім'я": "Студент3", "Дисципліна1": 3, "Дисципліна2": 3, "Дисципліна3": 5, "Дисципліна4": 3},
    {"Ім'я": "Студент4", "Дисципліна1": 2, "Дисципліна2": 4, "Дисципліна3": 4, "Дисципліна4": 5},
    {"Ім'я": "Студент5", "Дисципліна1": 1, "Дисципліна2": 2, "Дисципліна3": 3, "Дисципліна4": 4},
    {"Ім'я": "Студент6", "Дисципліна1": 5, "Дисципліна2": 5, "Дисципліна3": 5, "Дисципліна4": 5},
    {"Ім'я": "Студент7", "Дисципліна1": 3, "Дисципліна2": 3, "Дисципліна3": 4, "Дисципліна4": 4},
    {"Ім'я": "Студент8", "Дисципліна1": 3, "Дисципліна2": 4, "Дисципліна3": 2, "Дисципліна4": 2},
    {"Ім'я": "Студент9", "Дисципліна1": 5, "Дисципліна2": 2, "Дисципліна3": 3, "Дисципліна4": 3},
    {"Ім'я": "Студент10", "Дисципліна1": 4, "Дисципліна2": 5, "Дисципліна3": 4, "Дисципліна4": 5},

]

with open('students.csv', 'w', newline='') as csv_file:
    fieldnames = ["Ім'я", "Дисципліна1", "Дисципліна2", "Дисципліна3", "Дисципліна4"]
    writer = csv.DictWriter(csv_file, fieldnames=fieldnames)

    writer.writeheader()
    for student in data:
        writer.writerow(student)

print("Дані про студентів були збережені у файлі 'students.csv'.")
